In [1]:
import numpy as np
import pandas as pd

# 1. Creating a DataFrame from an array

### 1.1 Option 1

In [4]:
# creating an array using numpy

data = np.array([[1,4], [2,5], [3,6]])
data

array([[1, 4],
       [2, 5],
       [3, 6]])

In [8]:
# Creating a dataframe

df = pd.DataFrame(data, index=["row1", "row2", "row3"], columns=["col1", "col2"])
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

### 1.2 Option 2

In [9]:
# Creating an array with list shape

data = [[1,4], [2,5], [3,6]]
data

[[1, 4], [2, 5], [3, 6]]

In [11]:
# Creating a dataframe

df = pd.DataFrame(data, index=["row1", "row2", "row3"], columns=["col1", "col2"])
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# 2. Creating a DataFrame using a Dictionary

In [12]:
# lists used

states = ["California", "Texas", "Florida", "New York"]
population = [39613493, 29730311, 21944577, 19299981]

In [13]:
# Storing lists within a dictionary

dict_states = {"States":states, "Population":population}
dict_states

{'States': ['California', 'Texas', 'Florida', 'New York'],
 'Population': [39613493, 29730311, 21944577, 19299981]}

In [14]:
# Creating a dataframe

df_population = pd.DataFrame(dict_states)
df_population

       States  Population
0  California    39613493
1       Texas    29730311
2     Florida    21944577
3    New York    19299981

# 3. Creating a DataFrame using a csv file

In [15]:
# reading the csv file

df_exams = pd.read_csv('StudentsPerformance.csv')

In [16]:
# display first 5 rows of the dataframe

df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [19]:
# display last 5 rows of the dataframe

df_exams.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [20]:
# shape - give us the number of rows, columns

df_exams.shape

(1000, 8)

In [23]:
# display n rows

pd.set_option('display.max_rows', 30)
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

# 4. Attributes of the Data Frame

In [25]:
# shape - give us the number of rows, columns

df_exams.shape

(1000, 8)

In [27]:
# index atrribute- rows

df_exams.index

RangeIndex(start=0, stop=1000, step=1)

In [29]:
# column attribute - get all the columns of the data frame

df_exams.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [31]:
# get the data type of each column

df_exams.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object